Repository: yamato/perl6doc-jp
Catalog: tm/auto/S02-bits-20140914.tmx
Source language: en_us
Languages: ja

source: A further variant of hyper is the race list operator, which declares that you want the results so badly that you don't even care what order they come back in. Within its arguments, the race operator forces parallel evaluation of any iterator, hyper, or junction, such that if any single thread dies or hangs its computation, it does not block any other thread from returning its results to the race list.
ja: hyperの更なる変形は、raceリスト演算子である。そして、それは、あなたがそれらがどんな順序で戻るかについてさえ気にしないほどとても結果を望むと断言する。その引数の中で、race演算子は、何か反復子、ハイパーまたは交差点（何か一条ねじが止まるか、その計算を掛けるならば、それがレースリストに結果を返ることから何か他の糸をブロックしないような）の平行した評価を強制する。

source: When the demand for the race list drops, hung threads may be killed.
ja: レースリストを求める要求が減少するとき、掛けられた糸は殺されるかもしれない。

source: You can think of it as a gather with a 'try take start ...' on parallel computation.
ja: あなたは、それを'try take start ...'が並列処理にあるgatherとみなすことができる。

source: Note that exceptions are trapped by default;
ja: 例外がデフォルトで罠にかけられることに注意すべきである;

source: if your car crashes, you simply do not finish the race.
ja: 車が破壊するならば、あなたは単にレースを終えない。

source: If you want notifications of some sort back to the pit crew, you'll have to arrange them yourself.
ja: ピットクルーに何らかの通知を返して欲しいならば、あなたは自分でそれらを手配しなければならない。

source: It is a transitive contextualizer insofar as iterators will have to pass on the policy to subiterators.
ja: 反復子が保険証書をsubiteratorsに渡さなければならない限り、それは他動的なcontextualizerである。

source: The =&gt; operator
ja: =&gt;演算子

source: The =&gt; operator now constructs Pair objects rather than merely functioning as a comma.
ja: =&gt;演算子は、単にコンマとして機能するだけであることよりもむしろPairオブジェクトを現在造る。

source: Both sides are in item context.
ja: 双方は、アイテム前後関係にある。

source: The .. operator
ja: ..演算子

source: The .. operator now constructs a Range object rather than merely functioning as an operator.
ja: 単に演算子として機能するだけであるよりはむしろ、..演算子は現在Rangeオブジェクトを造る。

source: Semantically, the Range acts like a list of its values to the extent possible, but does so lazily, unlike Perl 5's eager range operator.
ja: 意味論的に、Perl 5の熱心な範囲演算子とは異なり、Rangeは可能な限りその値のリストのようなふりをするが、ゆったりとそうする。

source: Hash assignment
ja: ハッシュ割当て

source: There is no such thing as a hash list context.
ja: ハッシュリストコンテキストなんてものが、ない。

source: Assignment to a hash produces an ordinary list context.
ja: ハッシュへの代入は、普通のリストコンテキストを生じる。

source: You may assign alternating keys and values just as in Perl 5.
ja: あなたは、Perl 5の場合のようにちょうど交互のキーと値を割り当てるかもしれない。

source: You may also assign lists of Pair objects, in which case each pair provides a key and a value.
ja: あなたはPairオブジェクトのリストも割り当てるかもしれない、その場合には、各ペアはキーと値を提供する。

source: You may, in fact, mix the two forms, as long as the pairs come when a key is expected.
ja: キーが予想されるとき組が来る限り、あなたは、実際、2つの形を混ぜるかもしれない。

source: If you wish to supply a Pair as a key, you must compose an outer Pair in which the key is the inner Pair:
ja: キーとしてPairを供給したいならば、あなたはキーが内部のPairである外のPairを組み立てなければならない：

source: The anonymous enum function
ja: 匿名のenum関数

source: The anonymous enum function takes a list of keys or pairs, and adds values to any keys that are not already part of a pair.
ja: 匿名のenum関数はキーまたは組のリストをとって、値をすでに一組の一部でない何かキーに加える。

source: The value added is one more than the previous key or pair's value.
ja: 加えられる値は、前のキーまたは一組の値より、1である。

source: This works nicely with the new qq:ww form:
ja: これは、新しいqq:wwの形でうまく動く：

source: are the same as:
ja: 以下と同じようにある：

source: Hash binding
ja: ハッシュバインディング

source: In contrast to assignment, binding to a hash requires a Hash (or Pair) object, or anything that does the Associative role.
ja: 割当てと対照的に、ハッシュへのバインディングは、Hash（またはPair）オブジェクトまたはAssociativeロールをする何でも必要とする。

source: Files
ja: ファイル

source: * Filename globs are no longer done with angle brackets.
ja: * ファイル名小滴は、かぎ括弧でもはやされない。

source: Use the glob function.
ja: glob関数を使いなさい。

source: * Input from a filehandle is no longer done with angle brackets.
ja: * ファイルハンドルからの入力は、かぎ括弧でもはやされない。

source: Instead of
ja: の代わりに

source: you now write
ja: あなたは、現在書く

source: Grammatical Categories
ja: 文法範疇

source: Lexing in Perl 6 is controlled by a system of grammatical categories.
ja: Perl 6のLexingは、文法範疇のシステムによって支配される。

source: At each point in the parse, the lexer knows which subset of the grammatical categories are possible at that point, and follows the longest-token rule across all the active alternatives, including those representing any grammatical categories that are ready to match.
ja: 解析の各々の点で、lexerは、文法範疇のどのサブセットがそこであり得るかについてわかっていて、マッチに準備ができている何か文法範疇を表現しているそれらを含むすべての活発な選択肢全体で、最も長く形だけの規則に従う。

source: See S05 for a detailed description of this process.
ja: このプロセスの詳しい説明については、S05を見なさい。

source: To get a list of the current categories, grep 'token category:
ja: 現在のカテゴリー（grep『トークンカテゴリー』）のリストを得ること：

source: ' from STD.pm6.
ja: 『STD.pm6から。

source: Category names are used as the short name of both various operators and the rules that parse them, though the latter include an extra &quot;sym&quot;:
ja: 後者が余分の「sym」を含むけれども、カテゴリー名がそれらを解析するいろいろな演算子と規則の短いファイル名として使われる：

source: As you can see, the extension of the name uses colon pair notation.
ja: ご覧の通り、名前の拡張は、コロン一組表記法を使用する。

source: The :sym typically takes an argument giving the string name of the operator;
ja: :symは、演算子の文字列名を伝えている引数を概してする;

source: some of the &quot;circumfix&quot; categories require two arguments for the opening and closing strings.
ja: 「circumfix」カテゴリーのいくらかは、開閉文字列のために2つの引数を必要とする。

source: Since there are so many match rules whose symbol is an identifier, we allow a shorthand:
ja: シンボルが識別子であるそれほど多くのマッチ規則があるので、我々は短縮形を許す：

source: Conjecturally, we might also have other kinds of rules, such as tree rewrite rules:
ja: 推測で、我々には他の種類の規則（例えば木書き換え規則）もあるかもしれない：

source: Within a grammar, matching the proto subrule &lt;infix&gt; will match all visible rules in the infix category as parallel alternatives, as if they were separated by '|'.
ja: 文法の範囲内で、まるでそれらが'|'によって切り離されるように、プロトsubrule &lt;infix&gt;にマッチすることは平行した選択肢として挿入辞カテゴリーですべての見える規則に匹敵する。

source: Here are some of the names of parse rules in STD:
ja: STDの解析規則の名前のいくらかは、ここにある：

source: Note that some of these produce correspondingly named operators, but not all of them.
ja: これらの生産物の一部が対応してそれらの全てでなく、演算子の名前を挙げたことに注意すべきである。

source: When they do correspond (such as in the cmp example above), this is by convention, not by enforcement.
ja: それらが一致する（例えば上のcmp例で）とき、施行によってでなく、これは規則のそばにある。

source: (However, matching &lt;sym&gt; within one of these rules instead of the literal operator makes it easier to set up this correspondence in subsequent processing.)
ja: （しかし、文字通りの演算子の代わりにこれらの規則の1つの範囲内のマッチする&lt;sym&gt;は以降の処理においてこの通信を準備することをより簡単にする。）

source: The STD::Regex grammar also adds these:
ja: STD::Regex文法も、これらを加える：

source: Deprecations
ja: 非難

source: A language that doesn't evolve, is a dead language.
ja: 進化しない言語は、死語である。

source: Constructs that seem like a good idea now, may turn out not to be such a good idea in the future.
ja: 現在良い考えのようである構成概念は、将来そのような良い考えでないことがわかるかもしれない。

source: Such constructs will thus need to be deprecated.
ja: そのような構成概念は、このように廃止必要がある。

source: To mark a construct as being deprecated, one can add the &quot;is DEPRECATED($alternative)&quot; trait to a class, an attribute, or a sub / method.
ja: 廃止にしながら、構成概念に跡を残すために、人は&quot;is DEPRECATED($alternative)&quot;トレイトをクラス、属性またはsub / methodに加えることができる。

source: During execution, this will cause the caller sites to be recorded without any warnings.
ja: 実行の間、これは発信者サイトが何か警告なしで記録される原因になる。

source: When execution finishes, a report should be printed to STDERR stating which deprecated features where called where.
ja: 実行が終わるとき、レポートはそこで呼ばれる所で、どちらが機能を非難したかについて告示しているSTDERRに出力されなければならない。
